Revit 2027 API
Application.NewReferenceArray Method
Creates a new instance of a reference array.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferenceArray NewReferenceArray()
Public Function NewReferenceArray As ReferenceArray
public:
ReferenceArray^ NewReferenceArray()
member NewReferenceArray : unit -> ReferenceArray
Return Value
ReferenceArray
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace